from time import sleep
import sys
menu = 'Добро пожаловать в игру "Жизнь Игната"\n'
for i in menu:
        sleep(0.032)
        sys.stdout.write(i)
        sys.stdout.flush()
start = 'Введите "start", чтобы начать игру, а "end", чтобы Игната отчислили еще до начала сессии \n'
for i in start:
        sleep(0.032)
        sys.stdout.write(i)
        sys.stdout.flush()
menu = input()
if menu == 'start':
    a = 'Приключения Игната начинаются\n'
    for i in a:
        sleep(0.032)
        sys.stdout.write(i)
        sys.stdout.flush()
else:
    b = 'Bruh Игната отчислили еще до начала сессии\n'
    for i in b:
        sleep(0.032)
        sys.stdout.write(i)
        sys.stdout.flush()
    exit()

import random as r

hp = 3
coins = 2000
damage = 0
listw = ['Катиковк', 'Соф', 'Лер', 'Диан']
listm = ['Виталик', 'Никитосик', 'Баграт']


def printParameters():
    print("У тебя {0} жизней, {1} урона и {2} монет.".format(hp, damage, coins))


def printHp():
    print("У тебя", hp, "жизней.")


def printCoins():
    print("У тебя", coins, "монет.")


def printDamage():
    print("У тебя", damage, "урона.")


def meetShop():
    global hp
    global damage
    global coins

    def buy(cost):
        global coins
        if coins >= cost:
            coins -= cost
            printCoins()
            return True
        print("У тебя маловато монет!")
        return False

    weaponLvl = r.randint(1, 3)
    weaponDmg = r.randint(1, 5) * weaponLvl
    weapons = ["Бутылка получше", "Меч из Майнкрафта", "Тяпка", "Цветочек с клумбы", "Котлета из общего холодильника",
               "Аргумент"]
    weaponRarities = ["Обычный(ая)", "Редкий(ая)", "Легендарный(ая)"]
    weaponRarity = weaponRarities[weaponLvl - 1]
    weaponCost = r.randint(300, 1000) * weaponLvl
    weapon = r.choice(weapons)

    oneHpCost = 500
    threeHpCost = 1200

    print("""
============================================================================================================
На пути тебе встретился местный барыга Степан!

Оооо Привет Игнат, как дела? Как жизнь молодая?
Ладно не суть. У меня тут для тебя кое-что припасено.
Будешь брать?

Он предлагает тебе ознакомиться с его ассортиментом
============================================================================================================
    """)
    printParameters()

    if input("""
    Что ты будешь делать: 
    1 - Давай показывай, солнышко
    2 - Не, спасибо
""") == '1':
        print(f"""
============================================================================================================
Степа распахивает свой длинный плащ и вы в ожидании чего-то особенного наклоняетесь посмотреть поближе

    Там оказывается:
    1) Обед из Арены(+1HP) - {oneHpCost} рублей
    2) Шашлычок из Кавказкого дворика(+3HP) - {threeHpCost} рублей
    3) {weaponRarity} {weapon}(+{weaponDmg}урон(а)) - {weaponCost} рублей
============================================================================================================

Что хочешь приобрести?""")
        choice = input()
        if choice == "1":
            print('\nХм... Дай-ка мне обед, который ты взял в Арене\nСтепан: Варенье? Малиновое? Аааа. Понял\n')
            if buy(oneHpCost):
                hp += 1
                printHp()
            print('Вы съели Карбонару\n')
        elif choice == "2":
            print('\nХочу шашлычок из Кавказкого дворика\n*Степан протягивает тебе шампур шашлыка*\n')
            if buy(threeHpCost):
                hp += 3
                printHp()
            print('Вы очень вкусно покушали\n')
        elif choice == "3":
            print('\nХочу вот эту валыну\n')
            if buy(weaponCost):
                print('')
                damage = weaponDmg
                print('У вас теперь новое оружие')
                printDamage()
        elif choice == "4":
            print("\nНе, спасибо, что-то ничего не хочется")

        else:
            print("Прости, но кроме этого у меня больше ничего нет.")
    print("""============================================================================================================
""")


def meetMonster():
    global hp
    global coins

    monsterLvl = r.randint(1, 3)
    monsterHp = monsterLvl
    monsterDmg = monsterLvl * 2 - 1
    monsters = ["Пьяного Игорька", "Кого-то из Деканата", "Шкилу из лицея", "Эго Игната", "Контрольную точку"]

    monster = r.choice(monsters)

    print(f"""
============================================================================================================
Ты набрел на {monsters[r.randint(0, 4)]}, у него {monsterLvl} уровень, {monsterHp} жизней и {monsterDmg} урона.
Придется драться

*музыка боя из Скайрима*
""")
    printParameters()

    while monsterHp > 0:
        choice = input("""
    Что будешь делать?
    1 - Биться как мужик, я же Игнат, а не фермер какой-то
    2 - Сбегу как попуск, я слабенький
        """)

        if choice == "1":
            monsterHp -= damage
            print("Ты атаковал и у него(её) осталось", monsterHp, "жизней.")
        elif choice == "2":
            chance = r.randint(0, monsterLvl)
            if chance == 0:
                print("Тебе удалось сбежать с поля боя!")
                break
            else:
                print("Оно оказалося чересчур сильным и догнал тебя...")

        if monsterHp > 0:
            print('''Оно атаковало.
┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬███┬
┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬███┬┴
┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬████┴┬┴┬
┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴█┴┬█┬┴┬┴┬┴┬┴┬██┴┬┴┬┴┬┴
┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬█┬┴██┬┴┬┴┬┴┬██┴┬┴┬┴┬┴┬
█┬┴┬┴┬┴┬█┬┴┬┴┬┴█┴███┴██┬┴┬███┬┴┬┴█┴┬┴
██┬┴┬┴┬┴██┬┴┬┴┬█┬█████┬┴┬███┬┴┬┴██┬┴┬
┴███┴┬┴┬██┴┬┴███┴████┬┴██████┬┴██┬┴┬┴
┬┴███┴┬┴█┴┬┴███┴████████████████┬┴┬┴┬
┴┬┴┬██┴┬██┴┬██████┴┬┴███┴┬┴┬████┴┬┴┬█
┬█┬┴┬█┬┴┬████████┴┬┴┬┴██┬┴┬┴┬███┬┴┬██
┴██┬┴███████████┴┬┴┬┴┬┴┬┴┬┴┬┴███████┴
┬██┴┬┴█████┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴█████┴┬
┴┬█████████┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬████┴┬┴
┬┴┬████┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴██┬┴┬┴┬┴███┴┬┴┬
┴█████┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬██┴┬┴┬┴┬██┴┬┴┬┴
██████┬┴┬┴┬┴┬┴┬┴██┬┴┬┴██┬┴┬┴┬┴███████
┴█████┴┬┴┬██┴┬┴┬██┴┬┴┬██┴┬┴┬┴┬┴█████┴
┬████┴┬┴┬┴██┬┴┬┴██┬┴┬┴┬██┴┬┴┬┴┬██┴┬┴┬
┴████┬┴┬┴┬██┴┬┴┬██┴┬┴┬┴██┬┴┬┴┬┴██┬┴┬┴
┬█████┬┴┬┴██┬┴┬┴██┬┴┬┴┬██┴┬┴┬┴┬███┬┴┬
┴┬████┴┬┴┬██┴┬┴┬██┴┬┴┬┴██┬┴┬┴┬┴█████┴
┬█████┬┴┬┴██┬┴┬┴██┬┴┬┴┬██┴┬┴┬███┬┴███
███┬███┬┴┬██┴┬┴┬██┴┬┴┬┴████┴████┴┬┴┬┴
██┬┴████┬┴███┴┬┴████┴████████████┴┬┴┬
█┬┴┬┴┬██┴█████┴████████┬┴┬┴┬┴██┬██┴┬┴
┬┴┬┴┬┴┬█████████████┬┴███┴┬┴┬██┴┬┴┬┴┬
┴┬┴┬┴┬███┬██┴█████████┬┴┬┴████┴┬┴┬┴┬┴
┬┴┬┴┬┴██┬██┴┬███┬┴┬█████████┬┴┬┴┬┴┬┴┬
┴┬┴┬┴┬┴┬┴██┬┴┬█┬┴┬┴██┬┴┬┴┬██┴┬┴┬┴┬┴┬┴
┬┴┬┴┬┴┬┴┬█┬┴████┬┴┬██┴┬┴┬┴┬██┴┬┴┬┴┬┴┬
┴┬┴┬┴┬┴┬┴┬┴┬████┴┬┴██┬┴┬┴┬┴┬█┬┴┬┴┬┴┬┴
┬┴┬┴┬┴┬┴┬┴┬┴┬┴██┬┴██┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬
┴┬┴┬┴┬┴┬┴┬┴┬┴┬██┴┬█┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴
┬┴┬┴┬┴┬┴┬┴┬┴┬███┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬
┴┬┴┬┴┬┴┬┴┬┴┬┴█┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┴
┬┴┬┴┬┴▄██▄┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬█┬┴┬┴┬┴┬
┴┬┴┬┴┬█┬┴█┴█┴┬█┬█▀█┬┴┬┴┬▄▀▀┬┴█┴┬┴┬┴┬┴
┬┴┬┴┬┴███▀┴█┴┬█┬┴┬█▀▀█┬┴█┴┬┴┬█▀▀▀▄┬┴┬
┴┬┴┬┴┬█┴┬┴┬▀██▀┴┬┴█┬┴█┴┬▀▄▄┬┴█┴┬┴█┴┬┴
┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬''')
        break
        if hp <= 0: break
        else:
            loot = r.randint(0, 2) + monsterLvl
            coins += loot
            print("Тебе удалось одолеть {monster}, за что ты получил", loot, "монет.")
            printCoins()


def meetfriendm(listm):
    print(f"""
============================================================================================================
Ты набрел на своего лучшего друга {listm[r.randint(0, 2)] + 'а'}

Но он торопиться на пару, так что прошел мимо

Странный какой... Ещё и друг называется
*Вы грустите*
============================================================================================================
""")


def meetfriendw(listw):
    print(f"""
============================================================================================================
Ты набрел на свою лучшую подругу {listw[r.randint(0, 2)] + 'у'}

Но она торопиться на пару, так что прошела мимо

Странная какая... Ещё и друг называется
*Вы грустите*
============================================================================================================
""")


def musorka():
    global hp
    print(f"""
============================================================================================================
Ты идешь по коридорам колледжа и замечаешь мусорку из которой торчит скрепышь

Вы решаете подойти к ней

Больше вы ничего не помните
*Вы чувствуете насыщение и счастье* +1hp
============================================================================================================
""")
    hp += 1
    printHp()


def initGame(initHp, initCoins, initDamage):
    global hp
    global coins
    global damage

    hp = initHp
    coins = initCoins
    damage = initDamage



print(f"""============================================================================================================
                                    Добро пожаловть в игру Жизнь Игната

            Это приключение обычного студента IT-колледжа Сириус по имени Игнат, который мечтал
                               не отчислиться в первом семестре после сессии

На старте у вас есть:
Предмет: Бутылка (урон {damage})
Жизни: {hp}
Деньги: {coins} рублей
В вашем инвентаре повесилась мышь

Ваше приключение начинается здесь
============================================================================================================
""")


def gameLoop():
    situation = r.randint(0, 10)

    if situation == 0:
        meetShop()
    elif situation == 1:
        meetMonster()
    elif situation == 2:
        meetfriendm(listm)
    elif situation == 3:
        meetfriendw(listw)
    elif situation == 4:
        musorka()
    else:
        input("Блуждаем по колледжу...\n")

def gameLoop2():
    situation = r.randint(0, 10)

    if situation == 0:
        meetShop()
    elif situation == 1:
        meetMonster()
    elif situation == 2:
        meetfriendm(listm)
    elif situation == 3:
        meetfriendw(listw)
    elif situation == 4:
        musorka()
    else:
        input("Блуждаем по улице...\n")

def gameLoop3():
    situation = r.randint(0, 10)

    if situation == 0:
        meetShop()
    elif situation == 1:
        meetMonster()
    elif situation == 2:
        meetfriendm(listm)
    elif situation == 3:
        meetfriendw(listw)
    elif situation == 4:
        musorka()
    else:
        input("Блуждаем по общаге...\n")


initGame(3, 500, 1)

print('Игнат заспавнился в колледже')
for i in range(r.randint(10,15)):
    gameLoop()
print('Игнатик вышел на улицу')


print('Навстречу ему идёт Вася, наверное опять будет просить списать вы'
      ''
      'шмат ')
print('Вася: "Привет, Игнат, можешь дать списать вышмат?"')
print('Игнат: "Нет, ты опять спишешь всё слово в слово и мне поставят двойку')
print('Вася: "Странный какой... Ещё и друг называется"')
print('Вася грустный уходит')
for i in range(r.randint(10,15)):
    gameLoop2()
print('Игнат пришёл в общагу')


for i in range(r.randint(10, 15)):
    gameLoop3()
print('Игнат случайно нашел у себя в кармане бутылку пива и ашечку, но скоро придут воспитатели')
print('Что будешь делать?')
input('''
1 - Ничего, потому что мне пофиг
2 - Предложу бутылку пива воспитателю Никите
3 - Спрячу запрещёнку под подушку Миши 
''')
print('Вы проиграли, Игната отчислили(((')

